Examinator/src/DataProcessors/ИмпортСотрудниковСУО/ИмпортСотрудниковСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортСотрудниковСУО</name>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уволен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияВебКабинета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьДоступаВДнях</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроведенияПрограммыОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/DataProcessors/ИмпортСотрудниковСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает параметры загрузки.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   ПолноеИмяТабличнойЧасти   – Строка – полное имя табличной части, в которую загружаются данные.
//   АдресЗагружаемыхДанных    – Строка – адрес временного хранилища с таблицей значений, в которой
//                                          находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор – Число – порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления – Строка – адрес временного хранилища с пустой таблицей значений,
//                                          являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей – ТаблицаЗначений – список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       – Строка – имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор – Число  – идентификатор строки, в которой была обнаружена неоднозначность.
//   ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаСопоставления =  ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		СтрокаТП = ТаблицаСопоставления.Добавить();
		СтрокаТП.ПолноеИмя = СокрЛП(СтрокаТаблицы.ПолноеИмя);
		СтрокаТП.Имя = СокрЛП(СтрокаТаблицы.Имя);
		СтрокаТП.ЭлектроннаяПочта = СокрЛП(СтрокаТаблицы.ЭлектроннаяПочта);
		СтрокаТП.Телефон = СокрЛП(СтрокаТаблицы.Телефон);
		СтрокаТП.Код = СокрЛП(СтрокаТаблицы.Код);
		
		СтрокаТП.Организация = СокрЛП(СтрокаТаблицы.Организация);
		СтрокаТП.ПодразделениеОрганизации = СокрЛП(СтрокаТаблицы.ПодразделениеОрганизации);
		СтрокаТП.ПодразделениеПредприятия = СокрЛП(СтрокаТаблицы.ПодразделениеПредприятия);
		СтрокаТП.Должность = СокрЛП(СтрокаТаблицы.Должность);
		СтрокаТП.Уволен = СокрЛП(СтрокаТаблицы.Уволен);
		СтрокаТП.ТабельныйНомер = СокрЛП(СтрокаТаблицы.ТабельныйНомер);
		
		СтрокаТП.ГруппаПользователей = СокрЛП(СтрокаТаблицы.ГруппаПользователей);
		СтрокаТП.УчебнаяГруппа = СокрЛП(СтрокаТаблицы.УчебнаяГруппа);		
		
		СтрокаТП.ВходВПрограммуРазрешен = СокрЛП(СтрокаТаблицы.ВходВПрограммуРазрешен);
		СтрокаТП.АутентификацияСтандартная = СокрЛП(СтрокаТаблицы.АутентификацияСтандартная);
		СтрокаТП.АутентификацияОС = СокрЛП(СтрокаТаблицы.АутентификацияОС);
		СтрокаТП.АутентификацияOpenID = СокрЛП(СтрокаТаблицы.АутентификацияOpenID);
		СтрокаТП.АутентификацияВебКабинета = СокрЛП(СтрокаТаблицы.АутентификацияВебКабинета);
		СтрокаТП.ГруппаДоступа = СокрЛП(СтрокаТаблицы.ГруппаДоступа);
		СтрокаТП.Пароль = СокрЛП(СтрокаТаблицы.Пароль);
		СтрокаТП.ЗапрещеноИзменятьПароль = СокрЛП(СтрокаТаблицы.ЗапрещеноИзменятьПароль);
		СтрокаТП.ПользовательОС = СокрЛП(СтрокаТаблицы.ПользовательОС);
		СтрокаТП.ПоказыватьВСпискеВыбора = СокрЛП(СтрокаТаблицы.ПоказыватьВСпискеВыбора);
		СтрокаТП.ПродолжительностьДоступаВДнях = СокрЛП(СтрокаТаблицы.ПродолжительностьДоступаВДнях);
		СтрокаТП.НомерПроведенияПрограммыОбучения = СокрЛП(СтрокаТаблицы.НомерПроведенияПрограммыОбучения);
		СтрокаТП.НомерНовости = СокрЛП(СтрокаТаблицы.НомерНовости);
		СтрокаТП.Организатор = СокрЛП(СтрокаТаблицы.Организатор);
		
		
		// Ищем пользователя
		
		НайденныеПользователи = Новый Массив;
		
		// Сначала ищем по коду
		
		Если ЗначениеЗаполнено(СтрокаТП.Код) Тогда
			ПользователиПоКоду = ОбщегоНазначенияСУ.НайтиВсехПользователей("Код", СтрокаТП.Код);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоКоду, Истина);
		КонецЕсли;
		
		// Ищем по полному имени
		
		Если НайденныеПользователи.Количество() = 0 И ЗначениеЗаполнено(СтрокаТП.ПолноеИмя) Тогда
			ПользователиПоНаименованию = ОбщегоНазначенияСУ.НайтиВсехПользователей("Наименование", СтрокаТП.ПолноеИмя);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоНаименованию, Истина);
		КонецЕсли;
		
		// Определяем пользователя
		
		Если НайденныеПользователи.Количество() = 1 Тогда
			СтрокаТП.Пользователь = НайденныеПользователи[0];
		ИначеЕсли НайденныеПользователи.Количество() > 1 Тогда
			СтрокаТП.Пропустить = Истина;
		КонецЕсли;
			
	КонецЦикла;

	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти  – Строка – Полное имя табличной части, в которую загружаются данные.
//     ИмяКолонки               – Строка – Имя колонки, в который возникла неоднозначность. 
//  СписокНеоднозначностей    – Массив  – Массив для заполнения с неоднозначными данными.
//  ЗагружаемыеЗначенияСтрока – Строка  – Загружаемые данные, на основании которых возникла неоднозначность.
//  ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецЕсли
